{
  "EXPERIENCES": [
    {
      "position": "Desarrollador",
      "company": "Gobierno Digital",
      "place": "Querétaro Arteaga, México",
      "date": "01/2023",
      "stillWorkingThere": true,
      "tasks": [
        "Contribuí al diseño y desarrollo de nuevas plataformas web, así como al mantenimiento continuo de las existentes, desempeñándome como Desarrollador Web Full Stack.",
        "Utilicé tecnologías como NextJS, Svelte, NodeJS, JavaScript, TypeScript, ORACLE y Docker para implementar soluciones sólidas y eficientes.",
        "Colaboré estrechamente con equipos multidisciplinarios para traducir los requisitos comerciales en características funcionales y amigables para el usuario. Especializado en optimizar el rendimiento, garantizar la escalabilidad y mejorar la experiencia general del usuario."
      ]
    },
    {
      "position": "Desarrollador Web",
      "company": "Freelancer",
      "place": "Remoto",
      "date": "04/2022",
      "stillWorkingThere": true,
      "tasks": [
        "Ampliar experiencia en la creación integral de una plataforma de control de accesos mediante códigos QR. Encargado del diseño y desarrollo completo, utilicé Svelte para la interfaz principal, Angular para la aplicación principal, NodeJS como backend, y PostgreSQL como base de datos. Responsable de concebir y estructurar el sistema desde el principio hasta su despliegue exitoso",
        "Adopté metodologías ágiles para un desarrollo eficiente y adaptable, implementando medidas de seguridad avanzadas y estrategias de respaldo para asegurar la integridad y disponibilidad de los datos"
      ]
    },
    {
      "position": "Desarrollador Junior",
      "company": "Gobierno Digital",
      "place": "Querétaro Arteaga, México",
      "date": "03/2021 - 11/2022",
      "tasks": [
        "Desarrollo Web con el uso de tecnologías tanto de frontend como de backend. Especializado en la creación de nuevos módulos y el mantenimiento de los existentes utilizando JQuery, JavaScript, PHP y Oracle",
        "Habilidades en el diseño e implementación de páginas de registro y formularios. Comprometido con la entrega de soluciones sólidas y amigables para el usuario",
        "Mantenimiento y creación de formularios de registro para campañas electorales"
      ]
    }
  ],
  "EDUCATIONS": [
    {
      "carrer": "Ingeniería en Sistemas Computacionales",
      "school": "Universidad Autónoma de Aguascalientes",
      "place": "Aguascalientes, México",
      "date": "2015 - 2020"
    }
  ],
  "SKILLS": [
    "Typescript",
    "Javascript",
    "Angular",
    "AngularJS",
    "React",
    "Svelte",
    "Astro",
    "NextJS",
    "JQuery",
    "Tailwind",
    "Boostrap",
    "NodeJS",
    "PHP",
    "Oracle",
    "Postgres",
    "MySQL",
    "Docker"
  ],
  "LANGUAJES": ["Español", "Inglés"],
  "PROJECTS": [
    {
      "title": "Ezsecure",
      "url": "ezsecure.com.mx",
      "href": "https://ezsecure.com.mx",
      "picture_url": "/src/assets/images/ezsecure.png",
      "technologies": ["Angular", "Svelte", "NodeJS", "Postgres", "Typescript"],
      "description": "Ezsecure es una plataforma que proporciona soluciones integrales para el control de accesos y seguridad en condominios. Simplifica la gestión, mejora la seguridad y brinda una experiencia excepcional a residentes y visitantes."
    },
    {
      "title": "KindHealth",
      "url": "kindhealth.co",
      "href": "https://www.kindhealth.co/",
      "picture_url": "/src/assets/images/kindhealth.png",
      "technologies": ["NextJS", "Svelte", "Figma", "Postgres", "Typescript"],
      "description": "KindHealth es una plataforma que proporciona una estrategia de seguro personalizada para personas y familias para ayudar a protegerlos contra riesgos financieros."
    },
    {
      "title": "Eleckto",
      "url": "eleckto.com",
      "href": "https://eleckto.com/",
      "picture_url": "/src/assets/images/eleckto.png",
      "technologies": [
        "JQuery",
        "Bootstrap",
        "PHP",
        "ORACLE",
        "NodeJS",
        "Docker",
        "Javascript",
        "React"
      ],
      "description": "Creación de herramientas y estrategias para manejar un flujo correcto y efectivo de campañas logrando el éxito y triunfo electoral posicionándonos en la punta de la tecnología y de la confiabilidad de nuestros clientes."
    }
  ]
}
